

exports.GAME_STATUS = {
	//创建房间的菜单
	MENU: 0,
	//创建房间，等待加入
	CREATED: 1,
	//开启游戏中
	STARTED: 2,
	//游戏结束
	END: 3,
	//人机模式
	VSCOMPUTER: 4,
}

exports.OWNER_STATUS = {
	//允许黑白两字进行点击操作
	BOTH: -2,
	//都允许黑白两字进行点击操作
	BOTH_NOT: -1,
	//只允许黑子点击
	BLACK_ONLY: 0,
	//只允许白子子点击
	WHITE_ONLY: 1,
}

exports.DEFAULT_BLOCKS = [
	[-1, -1, -1, -1, -1, -1, -1, -1],
	[-1, -1, -1, -1, -1, -1, -1, -1],
	[-1, -1, -1, -1, -1, -1, -1, -1],
	[-1, -1, -1, 0, 1, -1, -1, -1],
	[-1, -1, -1, 1, 0, -1, -1, -1],
	[-1, -1, -1, -1, -1, -1, -1, -1],
	[-1, -1, -1, -1, -1, -1, -1, -1],
	[-1, -1, -1, -1, -1, -1, -1, -1],
]